app/controllers/airlines_controller.rb

SELECT "airlines".* FROM "airlines"
---
    def index
        airline = Airline.all

SELECT "airlines".* FROM "airlines" WHERE "airlines"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        airline = Airline.find_by(id: params[:id])

INSERT INTO "airlines" ("name", "image_url", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", nil], ["image_url", nil], ["slug", nil], ["created_at", "2022-12-10 17:08:08.967194"], ["updated_at", "2022-12-10 17:08:08.967194"]]
---
    def create
        airline = Airline.create(airline_params)