app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("title", "description", "score", "airline_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Great airline"], ["description", "I had a lovely time"], ["score", nil], ["airline_id", 1], ["created_at", "2022-12-10 17:15:10.629075"], ["updated_at", "2022-12-10 17:15:10.629075"]]
---
      def create
        review = Review.create(review_params)